# Energy Analysis Zone Cooling Air Temperature Property

Source: https://www.revitapidocs.com/2026/eb7a02fe-f8e3-79f1-5ed8-7323fbada1f1.htm

---

| Energy Analysis Zone Cooling Air Temperature Property |
| --- |

The cooling air temperature in unit Kelvin (K).
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CoolingAirTemperature { get; }
```

```
Public ReadOnly Property CoolingAirTemperature As Double
	Get
```

```
public:
property double CoolingAirTemperature {
	double get ();
}
```

```
member CoolingAirTemperature : float with get
```

#### Property Value

Double See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace